<?php

$config = [

    //Основное

    'database' => [                                     //  База данных
        'user' =>       "",                             //        Имя пользователя в базе данных
        'pass' =>   "",                             //        Пароль пользователя в базе данных
        'addr' =>         "",                             //        IP базы данныз
        'dbnm' =>     ""                              //        Имя базы данных
    ],
    'password' => [                                     //  Система пароля
        'system' =>     0,                              //        0 - WebMCR , 1 - DLE ,   2 - Другая                                      Какая у вас CMS?
        'add' => [                                      //     Уточнение
            0,                                          //        0 - MD5, 1 - Double MD5, 2 - md5(pass+salt),3-md5(md5(pass)+salt)        Какой у вас хэш пароля? (Если у вас не WebMCR не трогайте)
            0,                                          //        0 - 11.1 и меньше,1 - 11.2 и выше                                        Какая у вас версия DLE? (Если у вас не  DLE   не трогайте)
            2,                                          //        0 - MD5, 1 - Double MD5, 2 - md5(pass+salt),3 - md5(md5(pass)+salt),4 - bcrypt     Какой у вас хэш пароля? (Если у вас DLE или WebMCR не трогайте)
        ]
    ],
    'launcher' => [                                     //  Лаунчер
        'type' =>      0,                               //       0 - request, 1 - json                                                  Какой у вас тип авторизации?
        'user' =>      'login',                         //       Ключ запроса, который отвечает за имя    пользвотвателя? пример для request: ?LOGIN=%login%
        'pass' =>      'password',                      //       Ключ запроса, который отвечает за пароль пользвотвателя? пример для request: &PASSWORD=%password%
        'key' =>       "",                              //       Ключ проверки лаунчера, в ссылку надо будет добавить ?key=(ключ) (оставить пустым чтобы отключить)
    ],

    //Продвинутое

    'teh' => 0,                                         //       0 - Нет, 1 - Да                                                        Включены ли тех.работы?

    'additions' => [                                    //  Дополнения
        'type_ban' =>   0,                              //        0 - Отключена, 1 - Столбец у юзера, 2 - Отдельная таблица              Какая у вас система банов?
        'er' =>         0,                              //        0 - Нет, 1 - Да                                                        Выводить ли причину бана?
        'type_whi' =>   0,                              //        0 - Отключена, 1 - Столбец у юзера, 2 - Отдельная таблица              Какая у вас система вайтлиста?
    ],
    'table' => [                                        //  Если у вас не DLE и не WebMCR, укажите, какой столбец за что отвечает
        'name' =>       "",                             //        Имя таблицы с пользователями
        'username' =>   '',                             //        Столбец с именем пользователя
        'salt' =>       '',                             //        Столбец с солью пароля
        'password' =>   '',                             //        Столбец с паролем пользователя
        'email' =>      '',                             //        Столбец с почтой пользователя
        'ban' =>        '',                             //        Столбец с колоткой бана (1 - забанен, 0 - нет)                           (только если у вас первая система бана)
        'bt' =>         '',                             //        Столбец с временем бана (unix время окончания бана)                      (только если у вас первая система бана)
        'br' =>         '',                             //        Столбец с причиной бана (текстом)                                        (только если у вас первая система бана)
        'wh' =>         ''                              //        Столбец с колоткой вайтлиста (1 - добавлен , 0 - нет)                    (только если у вас первая система бана)
    ],
    'ban' => [                                          //  Таблица с банлистом (если у вас вторая система бана)
        'name' =>       '',                             //        Имя таблицы с банлистом
        'username' =>   '',                             //        Столбец с именем пользователя
        'reason' =>     '',                             //        Столбец с причиной бана
        'time' =>       ''                              //        Столбец с временем бана (unix время до какого времени)
    ],
    'wht' => [                                          //  Таблица с вайтлистом (если у вас вторая система Вайтлиста)
        'name' =>       '',                             //        Имя таблицы с вайтлистом
        'username' =>   '',                             //        Столбец с именем пользователя
    ],
    'mess' => [                                         //   Сообщения при ошибки
        'pas' =>        'Неверный логин или пароль!',   //        Ошибка неправильного пароля
        'ban' =>        'Извините, но вы забанены',     //        Ошибка при бане
        'adm' =>        'Ошибка, обратитесь к админам', //        Ошибка при ошибки в коде
        'teh' =>        'Лаунчер закрыт на тех. работы',//        Ошибка при тех. работах
        'wht' =>        'Вы не добавлены в вайтлист',   //        Ошибка при отсутствии игрока в вайтлисте
        'unk' =>        'Неизвестная ошибка!'           //        Ошибка при неизвестной ошибки
    ]
];


$vers = "1.2";                                          // Не трогайте, версия скрипта
if ($_GET['mimbol'] != "") {                            // Не трогайте, версия скрипта
    echo 'mimbol '.$vers;                                  // Не трогайте, версия скрипта
}
$tableHashs = [
    [
       "tables"=>[
           'mcr_users',
           'login',
           'salt',
           'password',
           'email'
       ],
       "hash"=>[0,1,2,3]
    ],
    [
        "tables"=>[
            'dle_users',
            'name',
            '',
            'password',
            'email'
        ],
        "hash"=>[1,4]
    ],
    [
        "tables"=>$config['table'],
        "hash"=>[0,1,2,3,4]
    ]
];
